## Excel'le calısma

In [1]:
import pandas as pd

In [3]:
d=pd.read_excel("ornek.xlsx")

In [4]:
d

  Unnamed: 0  salary  age       dep
0        jon    5000   42  engineer
1     mehmet    2500   40        hr
2         ed    8000   35   manager
3     tucker    1700   20    worker
4      viola    3560   53       NaN

In [8]:
s=d.dropna()

In [9]:
s

  Unnamed: 0  salary  age       dep
0        jon    5000   42  engineer
1     mehmet    2500   40        hr
2         ed    8000   35   manager
3     tucker    1700   20    worker

In [10]:
#yeniexcele kayıt

s.to_excel("yeni.xlsx")

In [11]:
#csv olursa read_csv / to_csv